## Plan Result (492: ptl_jenkins - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 13 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_cosmosdb_account.cosmosdb
  * azurerm_key_vault.jenkinskv
  * azurerm_key_vault_secret.logicappsecret
  * azurerm_managed_disk.disk
  * azurerm_resource_group.rg
  * azurerm_storage_account.storage_account
  * azurerm_user_assigned_identity.usermi
  * module.jenkins-webhook-relay.azurerm_api_connection.connection
  * module.jenkins-webhook-relay.azurerm_logic_app_integration_account.this
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group.azure_resource_group
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment
  * module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
* Replace
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_account.cosmosdb will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "cosmosdb" {
        id                                       = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics"
        name                                     = "sds-jenkins-pipeline-metrics"
      ~ tags                                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # azurerm_key_vault.jenkinskv will be updated in-place
  ~ resource "azurerm_key_vault" "jenkinskv" {
        id                              = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
        name                            = "ptl"
      ~ tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.logicappsecret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "logicappsecret" {
        id                      = "https://ptl.vault.azure.net/secrets/github-jenkins-ptl-logicapp/357b367d7397491096fcbe6dceff95d3"
        name                    = "github-jenkins-ptl-logicapp"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_managed_disk.disk will be updated in-place
  ~ resource "azurerm_managed_disk" "disk" {
        id                                = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/disks-ptl-rg/providers/Microsoft.Compute/disks/sds-jenkins-ptl-disk"
        name                              = "sds-jenkins-ptl-disk"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg"
        name       = "sds-jenkins-ptl-rg"
      ~ tags       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.Storage/storageAccounts/sdsjenkinsafactptl"
        name                               = "sdsjenkinsafactptl"
      ~ tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.usermi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "usermi" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi"
        name                = "jenkins-ptl-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_api_connection.connection will be updated in-place
  ~ resource "azurerm_api_connection" "connection" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
        name                = "github-sb-jenkins-con"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_integration_account.this will be updated in-place
  ~ resource "azurerm_logic_app_integration_account" "this" {
        id                                 = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.Logic/integrationAccounts/github-jenkins-sds-ptl"
        name                               = "github-jenkins-sds-ptl"
      ~ tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                                 = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.Logic/workflows/github-jenkins-sds-ptl"
        name                               = "github-jenkins-sds-ptl"
      ~ parameters                         = {
          - "$connections" = jsonencode(
                {
                  - servicebus_1 = {
                      - connectionId   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
                      - connectionName = "servicebus-connection"
                      - id             = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
                    }
                }
            ) -> null
        }
      ~ tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
      ~ workflow_parameters                = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group.azure_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "azure_resource_group" {
        id         = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg"
        name       = "github-jenkins-sds-ptl-rg"
      ~ tags       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
        id                       = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.Resources/deployments/logic-app-deployment"
        name                     = "logic-app-deployment"
      ~ output_content           = jsonencode(
            {
              - callbackUrl = {
                  - type  = "String"
                  - value = "https://prod-18.uksouth.logic.azure.com:443/workflows/c4c60ca53eb84d4d9542e97c65bcf595/triggers/manual/paths/invoke?api-version=2017-07-01&sp=%2Ftriggers%2Fmanual%2Frun&sv=1.0&sig=jBnqDQ44GYHcpTMLaFwvLLbSkZ8DHBQdhBkEXIxww9E"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = jsonencode(
          ~ {
              ~ commonTags             = {
                  ~ value = "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJobWN0cy9zZHMtamVua2lucy1pbmZyYXN0cnVjdHVyZSIsImJ1c2luZXNzQXJlYSI6IkNyb3NzLUN1dHRpbmciLCJjcml0aWNhbGl0eSI6IkhpZ2giLCJlbnZpcm9ubWVudCI6InByb2R1Y3Rpb24iLCJzdGFydHVwTW9kZSI6ImFsd2F5cyJ9" -> "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJobWN0cy9zZHMtamVua2lucy1pbmZyYXN0cnVjdHVyZSIsImJ1c2luZXNzQXJlYSI6IkNyb3NzLUN1dHRpbmciLCJjcml0aWNhbGl0eSI6IkhpZ2giLCJlbnZpcm9ubWVudCI6InByb2R1Y3Rpb24ifQ=="
                }
              - rg                     = {
                  - value = ""
                }
              - servicebus_queue       = {
                  - value = "jenkins"
                }
                # (5 unchanged attributes hidden)
            }
        )
      ~ tags                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
      ~ template_content         = jsonencode(
          ~ {
              ~ resources      = [
                  ~ {
                        name       = "[parameters('logic_app_name')]"
                      ~ properties = {
                          ~ definition         = {
                              ~ actions        = {
                                  ~ Execute_JavaScript_Code = {
                                      ~ inputs   = {
                                          ~ code                 = <<-EOT
                                                const i = workflowContext.trigger.outputs.body;
                                                
                                                i.pull_request && (
                                                  i.pull_request.title && (i.pull_request.title = i.pull_request.title.replace(/[^a-zA-Z0-9\s.,!?;:'"-]/g, '')),
                                                  i.pull_request.body && (i.pull_request.body = "*** Truncated ***"),
                                                  [i.pull_request.head, i.pull_request.base].forEach(repo => repo && repo.repo && repo.repo.description && (repo.repo.description = ""))
                                                );
                                                
                                                i.repository && i.repository.description && (i.repository.description = "");
                                                
                                                i.changes && i.changes.title && i.changes.title.from && (i.changes.title.from = i.changes.title.from.replace(/[^a-zA-Z0-9\s.,!?;:'"-]/g, ''));
                                                i.changes && i.changes.body && i.changes.body.from && (i.changes.body.from = "*** Truncated ***");
                                              - 
                                              + if(Array.isArray(i.commits) && i.commits.length > 10){i.commits = i.commits.slice(0,10);}
                                                return i;
                                            EOT
                                            # (1 unchanged attribute hidden)
                                        }
                                        # (2 unchanged attributes hidden)
                                    }
                                    # (2 unchanged attributes hidden)
                                }
                                # (5 unchanged attributes hidden)
                            }
                            # (3 unchanged attributes hidden)
                        }
                        tags       = "[variables('tags')]"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (5 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptl"
        name                                = "github-jenkins-sds-ptl"
      ~ tags                                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "github-jenkins-sds-ptl"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "github-jenkins-sds-ptl-rg"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptl/queues/jenkins" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "jenkins"
      ~ namespace_id                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptl" -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptl/queues/jenkins/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptl/queues/jenkins" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptl/queues/jenkins/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/github-jenkins-sds-ptl-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptl/queues/jenkins" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 13 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":92,"Program":"tfcmt","SHA1":"","Target":"492: ptl_jenkins - TerraformPlanApply","Vars":{}} -->